aron566/STM32F103ZET6_Bootloader/Middlewares/Third_Party/Easylogger/plugins/file/elog_file_port.c
/*
 * This file is part of the EasyLogger Library.
 *
 * Copyright (c) 2015-2019, Qintl, <qintl_linux@163.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files (the
 * 'Software'), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to
 * permit persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
 * CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
 * TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
 * SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * Function:  Portable interface for EasyLogger's file log pulgin.
 * Created on: 2019-01-05
 */

#include "elog_file.h"

#if USE_LINUX_SYSTEM        /**< 使用linux操作系统下的信号量*/
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <sys/ipc.h>
#include <sys/sem.h>
#include <unistd.h>
#define ELOG_FILE_SEM_KEY   ((key_t)0x19910612)
#ifdef _SEM_SEMUN_UNDEFINED
union semun {
    int              val;    /* Value for SETVAL */
    struct semid_ds *buf;    /* Buffer for IPC_STAT, IPC_SET */
    unsigned short  *array;  /* Array for GETALL, SETALL */
    struct seminfo  *__buf;  /* Buffer for IPC_INFO
                                (Linux-specific) */
};
#endif

static int semid = -1;
static struct sembuf const up = {0, 1, SEM_UNDO};
static struct sembuf const down = {0, -1, SEM_UNDO};

static void linux_lock_init(void);
static int linux_lock_open(void);

#elif USE_FREERTOS_SYSTEM                 /**< 使用FreeRTOS操作系统下的信号量*/
#include "stm32f1xx.h"
#include "cmsis_os.h"
osSemaphoreId ELOGFILETaskBinarySem01Handle;
osStaticSemaphoreDef_t ELOGFILETaskBinarySem01ControlBlock;
#endif
static void lock_init(void);
static void lock(void);
static void unlock(void);
/**
 * EasyLogger flile log pulgin port initialize
 *
 * @return result
 */
ElogErrCode elog_file_port_init(void)
{
    ElogErrCode result = ELOG_NO_ERR;

    /* add your code here */
    lock_init();
    return result;
}

/**
 * file log lock
 */
void elog_file_port_lock(void) {

    /* add your code here */
    lock();
}

/**
 * file log unlock
 */
void elog_file_port_unlock(void) {

    /* add your code here */
    unlock();
}

/**
 * file log deinit
 */
void elog_file_port_deinit(void) {

    /* add your code here */

}

#if USE_NONE_OS
/**
 * initialize the lock 
 */
static void linux_lock_init(void)
{
    int id, rc;
    union semun arg;
    struct sembuf sembuf;

    id = semget(ELOG_FILE_SEM_KEY, 1, IPC_CREAT | IPC_EXCL | 0666);
    if(likely(id == -1)) {
        id = linux_lock_open();
        if (id == -1)
            goto __exit;
    } else {
        arg.val = 0;
        rc = semctl(id, 0, SETVAL, arg);
        if (rc == -1)
            goto __exit;

        sembuf.sem_num = 0;
        sembuf.sem_op = 1;
        sembuf.sem_flg = 0;

        rc = semop(id, &sembuf, 1);
        if (rc == -1)
            goto __exit;
    }

    semid = id;
__exit:
    return ;
}

/**
 * gets the lock 
 */
static int linux_lock_open(void)
{
    int id, rc, i;
    union semun arg;
    struct semid_ds ds;

    id = semget(ELOG_FILE_SEM_KEY, 1, 0666);
    if(unlikely(id == -1))
        goto err;

    arg.buf = &ds;

    for (i = 0; i < 10; i++) {
        rc = semctl(id, 0, IPC_STAT, arg);
        if (unlikely(rc == -1))
            goto err;

        if(ds.sem_otime != 0)
            break;

        usleep(10 * 1000);
    }

    if (unlikely(ds.sem_otime == 0))
        goto err;

    return id;
err:
    return -1;
}
#endif

/**
  ******************************************************************
  * @brief   信号量初始化，操作系统下的初始化需放main中
  * @param   [in]None
  * @retval  None
  * @author  aron566
  * @version v1.0
  * @date    2020/6/26
  ******************************************************************
  */
static void lock_init(void)
{
#if USE_FREERTOS_SYSTEM
    osSemaphoreStaticDef(ELOGFILETaskBinarySem01, &ELOGFILETaskBinarySem01ControlBlock);
    ELOGFILETaskBinarySem01Handle = osSemaphoreCreate(osSemaphore(ELOGFILETaskBinarySem01), 1);
    xSemaphoreGive(ELOGFILETaskBinarySem01Handle);
#elif USE_LINUX_SYSTEM
    linux_lock_init();
#endif
}

/**
  ******************************************************************
  * @brief   信号量上锁
  * @param   [in]None
  * @retval  None
  * @author  aron566
  * @version v1.0
  * @date    2020/6/26
  ******************************************************************
  */
static void lock(void)
{
#if USE_FREERTOS_SYSTEM
    xSemaphoreTake(ELOGFILETaskBinarySem01Handle,(TickType_t)0xffffffUL);
#elif USE_LINUX_SYSTEM
    semid == -1 ? -1 : semop(semid, (struct sembuf *)&down, 1);
#endif
}

/**
  ******************************************************************
  * @brief   信号量解锁
  * @param   [in]None
  * @retval  None
  * @author  aron566
  * @version v1.0
  * @date    2020/6/26
  ******************************************************************
  */
static void unlock(void)
{
#if USE_FREERTOS_SYSTEM
    xSemaphoreGive(ELOGFILETaskBinarySem01Handle);
#elif USE_LINUX_SYSTEM
    semid == -1 ? -1 : semop(semid, (struct sembuf *)&up, 1);
#endif
}
